#pragma once
#include"start.h"
#include"main.h"

void start()
{
	cout << "           ⢀⣀⣀⣀⡀⠀⠀⠀⠀⠀⢀⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⣾⣿⣷⡄⠀" << endl;
	cout << "	  ⠐⠿⣿⣿⣿⣿⣿⣿⣶⣶⣤⣿⣿⣇⣀⠀⢀⣶⣶⡄⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⡇⠀" << endl;
	cout << "	  ⠀⠀⠀⠉⠙⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⣄⣀⣠⣾⣿⣿⣿⣿⣿⣿⠟⠀" << endl;
	cout << "  	⠀⠀   ⠀⠀⠀⠀⠘⠉⠛⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠁⠀⠀" << endl;
	cout << "	⠀⠀⠀ ⠀⠀⠀   ⠀⠀⠀⠉⠽⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀" << endl;
	cout << "		⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣾⣿⡆⠀⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⠟⠁⠻⣿⣿⣿⣿⣿⣿⠉⠀⠀⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⢙⣿⣿⣿⣿⣿⡄⣀⠀⠀⠀" << endl;
	cout << "	⢀⣠⣤⣄⣀⣀⣀⠀⠀⠀⣴⣿⣿⣿⣿⣿⠿⠋⠀⠀⠀⠀⠀⠀⠀⠸⢿⣿⣿⣿⣿⣿⠇⠀" << endl;
	cout << "	⠻⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⣿⣿⣿⠁⠀⠀" << endl;
	cout << "	⠀⠀⠈⠙⠻⢿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣹⣿⣿⣿⡇⠀⠀⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⣹⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣿⣿⣷⠀⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠉⠀⠸⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⡄⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⣿⡇⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠋⠀⠀" << endl;
	cout << "	⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀" << endl;
	cout << endl;
	cout << "******欢迎使用******" << endl;
	cout << "（1）登录 （2）注册" << endl;
	cout << "请选择您想进行的下一步操作序号：";
	string _wait;
	int operate;
选择操作3:
	getline(cin, _wait);
	if (!is_legal(_wait))
	{
		cout << "输入内容无效，请重新输入:";
		goto 选择操作3;
	}
	operate = to_int(_wait);
	if (operate < 1 || operate>2)
	{
		cout << "输入内容无效，请重新输入:";
		goto 选择操作3;
	}
	switch (operate)
	{
	case 1:
		log();
		break;
	case 2:
		sign();
		main();
		break;

	}
}